Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ConsultaDisponibleVentaMonedaExtranjera/wsdl/consultaDisponibleVentaMonedaExtranjeraPS.wsdl

<wsdl:definitions name="consultaDisponibleVentaMonedaExtranjeraPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaDisponibleVentaMonedaExtranjeraPS/" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:con="http://www.ficohsa.com.hn/middleware.services/consultaDisponibleVentaMonedaExtranjeraPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.ficohsa.com.hn/middleware.services/consultaDisponibleVentaMonedaExtranjeraTypes" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <wsdl:types>
        <xsd:schema>
            <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
        </xsd:schema>
        <xsd:schema>
            <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaDisponibleVentaMonedaExtranjeraTypes" schemaLocation="../xsd/consultaDisponibleVentaMonedaExtranjeraTypes.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="requestHeader">
        <wsdl:part element="auth:RequestHeader" name="RequestHeader"/>
    </wsdl:message>
    <wsdl:message name="responseHeader">
        <wsdl:part element="auth:ResponseHeader" name="ResponseHeader"/>
    </wsdl:message>
    <wsdl:message name="consultaDisponibleVentaMonedaExtranjera">
        <wsdl:part element="tns:consultaDisponibleVentaMonedaExtranjera" name="parameters"/>
    </wsdl:message>
    <wsdl:message name="consultaDisponibleVentaMonedaExtranjeraResponse">
        <wsdl:part element="tns:consultaDisponibleVentaMonedaExtranjeraResponse" name="result"/>
    </wsdl:message>
    <wsdl:portType name="consultaDisponibleVentaMonedaExtranjeraPS">
        <wsdl:operation name="consultaDisponibleVentaMonedaExtranjera" parameterOrder="parameters RequestHeader ResponseHeader">
            <wsdl:input message="con:consultaDisponibleVentaMonedaExtranjera"/>
            <wsdl:output message="con:consultaDisponibleVentaMonedaExtranjeraResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="consultaDisponibleVentaMonedaExtranjeraPSSOAP" type="con:consultaDisponibleVentaMonedaExtranjeraPS">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="consultaDisponibleVentaMonedaExtranjera">
            <soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaDisponibleVentaMonedaExtranjeraPS/consultaDisponibleVentaMonedaExtranjera"/>
            <wsdl:input>
                <soap:body parts="parameters" use="literal"/>
                <soap:header message="con:requestHeader" part="RequestHeader" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body parts="result" use="literal"/>
                <soap:header message="con:responseHeader" part="ResponseHeader" use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="consultaDisponibleVentaMonedaExtranjeraPS">
        <wsdl:port binding="con:consultaDisponibleVentaMonedaExtranjeraPSSOAP" name="consultaDisponibleVentaMonedaExtranjeraPSSOAP">
            <soap:address location="https://mwomnicanal:8004/Middleware/OperationsAndExecution/ConsumerService/ConsultaDisponibleVentaMonedaExtranjera"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>